"""Задача 34:
Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм.
Поскольку разобраться в его кричалках не настолько просто,
насколько легко он их придумывает, Вам стоит написать программу.
Винни-Пух считает, что ритм есть, если число слогов (т.е. число
гласных букв) в каждой фразе стихотворения одинаковое.
Фраза может состоять из одного слова, если во фразе несколько слов,
то они разделяются дефисами. Фразы отделяются друг
от друга пробелами. Стихотворение Винни-Пух вбивает в программу с клавиатуры.
В ответе напишите “Парам пам-пам”, если с ритмом все в порядке и
“Пам парам”, если с ритмом все не в порядке.

Ввод:                                       Вывод:
пара-ра-рам рам-пам-папам па-ра-па-дам      Парам пам-пам"""

def rifma(stih):
    list_1 = stih.split(' ') #инфу взял тут https://tonais.ru/string/kak-razbit-stroku-python
    for word in list_1:
        sum = 0
        for i in word:
            if i in 'ауоыиэяюёе':
                sum +=1
            
        


stih = 'пара-ра-рам рам-пам-папам па-ра-па-дам'

if rifma(stih):
    print('Парам пам-пам')
else:
    print('Пам парам')